In [1]:
import os
import pandas as pd

In [2]:
boston_housing = pd.read_csv(os.path.join('data', 'boston_housing', 'test.csv'))

In [3]:
boston_housing.describe()

                Id  OverallQual    GrLivArea   GarageArea
count   259.000000   259.000000   259.000000   259.000000
mean   1331.000000     6.081081  1548.030888   475.467181
std      74.911058     1.379947   560.911287   219.228602
min    1202.000000     3.000000   630.000000     0.000000
25%    1266.500000     5.000000  1148.000000   336.000000
50%    1331.000000     6.000000  1513.000000   484.000000
75%    1395.500000     7.000000  1844.000000   574.000000
max    1460.000000    10.000000  5642.000000  1418.000000

In [4]:
titanic = pd.read_csv(os.path.join('data', 'titanic', 'train.csv'))

In [5]:
titanic.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [6]:
titanic.Sex = (titanic.Sex == 'male').astype(float)
titanic.Sex[:10]

0    1.0
1    0.0
2    0.0
3    0.0
4    1.0
5    1.0
6    1.0
7    1.0
8    0.0
9    0.0
Name: Sex, dtype: float64

In [7]:
def cat2vec(x):
    if x == 'S':
        return 0.0
    elif x == 'C':
        return 1.0
    elif x == 'Q':
        return 2.0
    else:
        return 0.0

titanic['Embarked'] = titanic['Embarked'].apply(cat2vec)

In [8]:
titanic.describe()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
count,891.000000,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,0.647587,29.699118,0.523008,0.381594,32.204208,0.361392
std,257.353842,0.486592,0.836071,0.477990,14.526497,1.102743,0.806057,49.693429,0.635673
min,1.000000,0.000000,1.000000,0.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,0.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,446.000000,0.000000,3.000000,1.000000,28.000000,0.000000,0.000000,14.454200,0.000000
75%,668.500000,1.000000,3.000000,1.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,891.000000,1.000000,3.000000,1.000000,80.000000,8.000000,6.000000,512.329200,2.000000

In [9]:
titanic.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1.0,22.0,1,0,A/5 21171,7.2500,NaN,0.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0.0,38.0,1,0,PC 17599,71.2833,C85,1.0
2,3,1,3,"Heikkinen, Miss. Laina",0.0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0.0,35.0,1,0,113803,53.1000,C123,0.0
4,5,0,3,"Allen, Mr. William Henry",1.0,35.0,0,0,373450,8.0500,NaN,0.0

In [10]:
titanic.var()

PassengerId    66231.000000
Survived           0.236772
Pclass             0.699015
Sex                0.228475
Age              211.019125
SibSp              1.216043
Parch              0.649728
Fare            2469.436846
Embarked           0.404081
dtype: float64